tests/incompressibleDarcy_04/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0   0)
    (1 0   0)
    (1 0.1 0)
    (0 0.1 0)
    (0 0   0.1)
    (1 0   0.1)
    (1 0.1 0.1)
    (0 0.1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 1 1) simpleGrading (1 1 1)
);

boundary
(
    top
    {
        type empty;
        faces
        (
            (2 3 7 6)
        );
    }

    bottom
    {
        type empty;
        faces
        (
            (0 1 5 4)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }

    right
    {
        type patch;
        faces
        (
            (6 5 1 2)
        );
    }

    left
    {
        type patch;
        faces
        (
            (4 7 3 0)
        );
    }
);

// ************************************************************************* //
