tests/incompressibleDarcy_04/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volTensorFieldValue K (
        1e-10 0     0
        0     1e-10 0
        0     0     1e-10
    )

);

regions
(
    // Setting values inside a box
    boxToCell
    {
        box     (0.03 0 0) (0.07 0.1 0.1);
        fieldValues
        (
            volTensorFieldValue K (
                1e-11 0     0
                0     1e-11 0
                0     0     1e-11
            )

        );
    }
);


// ************************************************************************* //
